&Пластилин
Перем КонфигурацияХаба;

&Контроллер("/download")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ТочкаМаршрута("")
Процедура ОтдатьФайл(Ответ, ПараметрыЗапросаПорядковые) Экспорт
	ОтдатьИзКаталога(Ответ, "download", ПараметрыЗапросаПорядковые);
КонецПроцедуры

Процедура ОтдатьИзКаталога(Знач Ответ, Знач ОтносительныйКаталог, Знач Сегменты) Экспорт

	Если Сегменты = Неопределено Или Сегменты.Количество() = 0 Тогда
		Ответ.УстановитьСостояниеНеНайдено();
		Возврат;
	КонецЕсли;

	ОтносительныйПуть = ОтносительныйКаталог;
	Для Каждого Сегмент Из Сегменты Цикл
		ОтносительныйПуть = ОбъединитьПути(ОтносительныйПуть, Сегмент);
	КонецЦикла;

	ПутьКФайлу = ОбъединитьПути(КонфигурацияХаба.КаталогХраненияПакетов(), ОтносительныйПуть);
	ИскомыйФайл = Новый Файл(ПутьКФайлу);

	Если Не (ИскомыйФайл.Существует() И ИскомыйФайл.ЭтоФайл()) Тогда
		Ответ.УстановитьСостояниеНеНайдено();
		Возврат;
	КонецЕсли;

	Ответ.Заголовки["Content-Type"] = "application/octet-stream";
	Ответ.Заголовки["Content-Disposition"] = СтрШаблон("attachment; filename=""%1""", ИскомыйФайл.Имя);
	Ответ.ТелоДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);

КонецПроцедуры
