// Fluent-API для описания пакета (используется при чтении opm-metadata.xml)

Перем мСвойстваПакета;
Перем мЗависимости;
Перем мМодули;
Перем мВключаемыеФайлы;
Перем мИсполняемыеФайлы;

Перем ТипыМодулей Экспорт;

Функция Имя(Знач Параметр) Экспорт
	мСвойстваПакета.Вставить("Имя", Параметр);
	Возврат ЭтотОбъект;
КонецФункции

Функция Версия(Знач Параметр) Экспорт
	мСвойстваПакета.Вставить("Версия", Параметр);
	Возврат ЭтотОбъект;
КонецФункции

Функция Автор(Знач Параметр) Экспорт
	мСвойстваПакета.Вставить("Автор", Параметр);
	Возврат ЭтотОбъект;
КонецФункции

Функция Описание(Знач Параметр) Экспорт
	мСвойстваПакета.Вставить("Описание", Параметр);
	Возврат ЭтотОбъект;
КонецФункции

Функция АдресАвтора(Знач Параметр) Экспорт
	мСвойстваПакета.Вставить("АдресАвтора", Параметр);
	Возврат ЭтотОбъект;
КонецФункции

Функция АдресРепозитория(Знач Параметр) Экспорт
	мСвойстваПакета.Вставить("АдресРепозитория", Параметр);
	Возврат ЭтотОбъект;
КонецФункции

Функция ВерсияСреды(Знач Параметр) Экспорт
	мСвойстваПакета.Вставить("ВерсияСреды", Параметр);
	Возврат ЭтотОбъект;
КонецФункции

Функция ТочкаВхода(Знач Параметр) Экспорт
	мСвойстваПакета.Вставить("ТочкаВхода", Параметр);
	Возврат ЭтотОбъект;
КонецФункции

Функция Задачи(Знач Параметр) Экспорт
	мСвойстваПакета.Вставить("Задачи", Параметр);
	Возврат ЭтотОбъект;
КонецФункции

Функция Свойства() Экспорт
	Если Не мСвойстваПакета.Свойство("Имя") Или Не ЗначениеЗаполнено(мСвойстваПакета.Имя) Тогда
		ВызватьИсключение "Не задано имя пакета";
	КонецЕсли;
	Если Не мСвойстваПакета.Свойство("Версия") Или Не ЗначениеЗаполнено(мСвойстваПакета.Версия) Тогда
		ВызватьИсключение "Не задана версия пакета";
	КонецЕсли;

	Копия = Новый Структура;
	Для Каждого Свойство Из мСвойстваПакета Цикл
		Копия.Вставить(Свойство.Ключ, Свойство.Значение);
	КонецЦикла;
	Возврат Копия;
КонецФункции

Функция ЗависитОт(Знач ИмяПакета, Знач МинимальнаяВерсия = Неопределено, Знач МаксимальнаяВерсия = Неопределено) Экспорт
	ТекЗависимость = Зависимость(ИмяПакета);
	Если ТекЗависимость = Неопределено Тогда
		ТекЗависимость = мЗависимости.Добавить();
		ТекЗависимость.ИмяПакета = ИмяПакета;
	КонецЕсли;
	Если МинимальнаяВерсия = Неопределено Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	ТекЗависимость.МинимальнаяВерсия = МинимальнаяВерсия;
	ТекЗависимость.МаксимальнаяВерсия = МаксимальнаяВерсия;
	Возврат ЭтотОбъект;
КонецФункции

Функция Зависимость(Знач ИмяПакета) Экспорт
	Возврат мЗависимости.Найти(ИмяПакета, "ИмяПакета");
КонецФункции

Функция Зависимости() Экспорт
	Возврат мЗависимости.Скопировать();
КонецФункции

Функция ОпределяетКласс(Знач Идентификатор, Знач Файл) Экспорт
	ЗарегистрироватьМодульПакета(Идентификатор, Файл, ТипыМодулей.Класс);
	Возврат ЭтотОбъект;
КонецФункции

Функция Классы() Экспорт
	Возврат мМодули.Скопировать(Новый Структура("Тип", ТипыМодулей.Класс));
КонецФункции

Функция ОпределяетМодуль(Знач Идентификатор, Знач Файл) Экспорт
	ЗарегистрироватьМодульПакета(Идентификатор, Файл, ТипыМодулей.Модуль);
	Возврат ЭтотОбъект;
КонецФункции

Функция Модули() Экспорт
	Возврат мМодули.Скопировать(Новый Структура("Тип", ТипыМодулей.Модуль));
КонецФункции

Функция ВсеМодулиПакета() Экспорт
	Возврат мМодули.Скопировать();
КонецФункции

Процедура ЗарегистрироватьМодульПакета(Знач Идентификатор, Знач Файл, Знач Тип)
	Существует = мМодули.НайтиСтроки(Новый Структура("Идентификатор,Тип", Идентификатор, Тип));
	Если Существует.Количество() Тогда
		ВызватьИсключение "Уже определен " + НРег(Тип) + " с именем " + Идентификатор;
	КонецЕсли;
	Объявление = мМодули.Добавить();
	Объявление.Идентификатор = Идентификатор;
	Объявление.Файл = Файл;
	Объявление.Тип = Тип;
КонецПроцедуры

Функция ВключитьФайл(Знач ИсходныйПуть) Экспорт
	мВключаемыеФайлы.Добавить(ИсходныйПуть);
	Возврат ЭтотОбъект;
КонецФункции

Функция ВключаемыеФайлы() Экспорт
	Возврат мВключаемыеФайлы;
КонецФункции

Функция ИсполняемыйФайл(Знач Путь, Знач ИмяПриложения = "") Экспорт
	Стр = мИсполняемыеФайлы.Добавить();
	Стр.Путь = Путь;
	Стр.ИмяПриложения = ИмяПриложения;
	Возврат ЭтотОбъект;
КонецФункции

Функция ИсполняемыеФайлы() Экспорт
	Возврат мИсполняемыеФайлы;
КонецФункции

Процедура Инициализация()
	мСвойстваПакета = Новый Структура;

	мЗависимости = Новый ТаблицаЗначений;
	мЗависимости.Колонки.Добавить("ИмяПакета");
	мЗависимости.Колонки.Добавить("МинимальнаяВерсия");
	мЗависимости.Колонки.Добавить("МаксимальнаяВерсия");

	мМодули = Новый ТаблицаЗначений;
	мМодули.Колонки.Добавить("Идентификатор");
	мМодули.Колонки.Добавить("Файл");
	мМодули.Колонки.Добавить("Тип");

	ТипыМодулей = Новый Структура("Класс,Модуль", "Класс", "Модуль");

	мВключаемыеФайлы = Новый Массив;
	мИсполняемыеФайлы = Новый ТаблицаЗначений;
	мИсполняемыеФайлы.Колонки.Добавить("Путь");
	мИсполняемыеФайлы.Колонки.Добавить("ИмяПриложения");
КонецПроцедуры

Инициализация();
