&Идентификатор
&Колонка(Тип = "Строка")
Перем Код Экспорт;

&Колонка
Перем Название Экспорт;

&Колонка
Перем Описание Экспорт;

&Колонка(Тип = "Ссылка", ТипСсылки = "Автор")
Перем Автор Экспорт;

&Колонка
Перем АктуальнаяВерсия Экспорт;

&Колонка
Перем КлючевыеСлова Экспорт;

&Колонка
Перем Путь Экспорт;

&Колонка
Перем ИмяПроекта Экспорт;

&Колонка
Перем СсылкаНаПроект Экспорт;

&Колонка
Перем ПутьКОписанию Экспорт;

&Колонка(Тип = "ДатаВремя")
Перем ДатаСоздания Экспорт;

&Колонка(Тип = "ДатаВремя")
Перем ДатаОбновления Экспорт;

&Сущность(ИмяТаблицы = "Пакеты")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

Функция Пустой() Экспорт
	Возврат Не ЗначениеЗаполнено(Код);
КонецФункции
