// Чтение метаданных из ospx-архива пакета.

#Использовать tempfiles
#Использовать logos

Перем мВременныйКаталогУстановки;
Перем Лог;

Функция ПрочитатьМетаданныеПакета(Знач ФайлАрхива) Экспорт

	Лог = Логирование.ПолучитьЛог("oscript.web.hub.package-files");
	мВременныйКаталогУстановки = ВременныеФайлы.СоздатьКаталог();

	Попытка
		ЧтениеПакета = Новый ЧтениеZipФайла;
		ЧтениеПакета.Открыть(ФайлАрхива);

		ФайлМетаданных = ИзвлечьОбязательныйФайл(ЧтениеПакета, "opm-metadata.xml");
		Метаданные = ПрочитатьМетаданные(ФайлМетаданных);
	Исключение
		ВременныеФайлы.Удалить();
		ВызватьИсключение;
	КонецПопытки;

	ВременныеФайлы.Удалить();
	Возврат Метаданные;
КонецФункции

Функция ПрочитатьМетаданные(Знач ФайлМетаданных)

	Перем Метаданные;
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ФайлМетаданных);
	Попытка
		Сериализатор = Новый СериализацияМетаданныхПакета;
		Метаданные = Сериализатор.ПрочитатьXML(Чтение);
		Чтение.Закрыть();
	Исключение
		Чтение.Закрыть();
		ВызватьИсключение;
	КонецПопытки;
	Возврат Метаданные;

КонецФункции

Функция ИзвлечьОбязательныйФайл(Знач Чтение, Знач ИмяФайла)
	Элемент = Чтение.Элементы.Найти(ИмяФайла);
	Если Элемент = Неопределено Тогда
		ВызватьИсключение "Неверная структура пакета. Не найден файл " + ИмяФайла;
	КонецЕсли;
	Чтение.Извлечь(Элемент, мВременныйКаталогУстановки);
	Возврат ОбъединитьПути(мВременныйКаталогУстановки, ИмяФайла);
КонецФункции
