#Использовать logos

Перем ИменаКоллекцийПакета;
Перем Лог;

Функция ПрочитатьXML(Знач ЧтениеXML) Экспорт

	ЧтениеXML.ПерейтиКСодержимому();
	Описание = Новый ОписаниеПакета();

	Лог.Отладка("Начинаю чтение манифеста из XML. Корневой узел: " + ЧтениеXML.ЛокальноеИмя);
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		ПрочитатьУзлыПакета(ЧтениеXML, Описание);
	КонецЕсли;
	Лог.Отладка("Манифест прочитан");

	Возврат Описание;

КонецФункции

Функция СоответствиеИменСвойствДляЧтения()
	Соотв = Новый Соответствие;
	Соотв.Вставить("name", "Имя");
	Соотв.Вставить("version", "Версия");
	Соотв.Вставить("author", "Автор");
	Соотв.Вставить("description", "Описание");
	Соотв.Вставить("author-email", "АдресАвтора");
	Соотв.Вставить("repo-address", "АдресРепозитория");
	Соотв.Вставить("engine-version", "ВерсияСреды");
	Возврат Соотв;
КонецФункции

Процедура ПрочитатьУзлыПакета(Знач ЧтениеXML, Знач ОписаниеПакета)

	СоответствиеИмен = СоответствиеИменСвойствДляЧтения();
	Рефлектор = Новый Рефлектор;

	Пока ЧтениеXML.Прочитать() И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл

		ИмяУзла = ЧтениеXML.ЛокальноеИмя;
		Если ИмяУзла = ИменаКоллекцийПакета().Зависимости Тогда
			ПрочитатьЗависимости(ЧтениеXML, ОписаниеПакета);
		ИначеЕсли ИмяУзла = ИменаКоллекцийПакета().ИсполняемыеФайлы Тогда
			ПрочитатьИсполняемыеФайлы(ЧтениеXML, ОписаниеПакета);
		ИначеЕсли ИмяУзла = ИменаКоллекцийПакета().ОбъявлениеМодулей Тогда
			ПрочитатьЯвноеОбъявлениеМодулей(ЧтениеXML, ОписаниеПакета);
		ИначеЕсли ИмяУзла = ИменаКоллекцийПакета().ВключаемыеФайлы Тогда
			ПрочитатьВключаемыеФайлы(ЧтениеXML, ОписаниеПакета);
		Иначе
			ИмяСвойства = СоответствиеИмен[ИмяУзла];
			Если ИмяСвойства <> Неопределено Тогда
				Значение = ПрочитатьТекст(ЧтениеXML);
				Параметры = Новый Массив;
				Параметры.Добавить(Значение);
				Рефлектор.ВызватьМетод(ОписаниеПакета, ИмяСвойства, Параметры);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ПрочитатьЗависимости(Знач ЧтениеXML, Знач ОписаниеПакета)
	Имя = ЧтениеXML.ПолучитьАтрибут("name");
	Если Имя = Неопределено Тогда
		ВызватьИсключение "Некорректно заданы зависимости в XML описании пакета";
	КонецЕсли;
	МинВерсия = ЧтениеXML.ПолучитьАтрибут("version");
	МаксВерсия = ЧтениеXML.ПолучитьАтрибут("version-max");
	ОписаниеПакета.ЗависитОт(Имя, МинВерсия, МаксВерсия);
	ЧтениеXML.Прочитать();
КонецПроцедуры

Процедура ПрочитатьИсполняемыеФайлы(Знач ЧтениеXML, Знач ОписаниеПакета)
	ИмяПриложения = ЧтениеXML.ПолучитьАтрибут("name");
	Путь = ПрочитатьТекст(ЧтениеXML);
	Если Путь <> Неопределено Тогда
		ОписаниеПакета.ИсполняемыйФайл(Путь, ИмяПриложения);
	КонецЕсли;
КонецПроцедуры

Процедура ПрочитатьВключаемыеФайлы(Знач ЧтениеXML, Знач ОписаниеПакета)
	Путь = ПрочитатьТекст(ЧтениеXML);
	Если Путь <> Неопределено Тогда
		ОписаниеПакета.ВключитьФайл(Путь);
	КонецЕсли;
КонецПроцедуры

Процедура ПрочитатьЯвноеОбъявлениеМодулей(Знач ЧтениеXML, Знач ОписаниеПакета)
	Пока ЧтениеXML.Прочитать() И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		Идентификатор = ЧтениеXML.ПолучитьАтрибут("name");
		Источник = ЧтениеXML.ПолучитьАтрибут("src");
		Если ЧтениеXML.ЛокальноеИмя = "module" Тогда
			ОписаниеПакета.ОпределяетМодуль(Идентификатор, Источник);
		ИначеЕсли ЧтениеXML.ЛокальноеИмя = "class" Тогда
			ОписаниеПакета.ОпределяетКласс(Идентификатор, Источник);
		КонецЕсли;
		ЧтениеXML.Прочитать();
	КонецЦикла;
КонецПроцедуры

Функция ПрочитатьТекст(Знач Чтение)
	Результат = Неопределено;
	Пока Чтение.Прочитать() И Чтение.ТипУзла = ТипУзлаXML.Текст Цикл
		Результат = Чтение.Значение;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ИменаКоллекцийПакета()
	Если ИменаКоллекцийПакета = Неопределено Тогда
		ИменаКоллекцийПакета = Новый Структура;
		ИменаКоллекцийПакета.Вставить("Зависимости", "depends-on");
		ИменаКоллекцийПакета.Вставить("ИсполняемыеФайлы", "executable");
		ИменаКоллекцийПакета.Вставить("ВключаемыеФайлы", "include-content");
		ИменаКоллекцийПакета.Вставить("ОбъявлениеМодулей", "explicit-modules");
	КонецЕсли;
	Возврат ИменаКоллекцийПакета;
КонецФункции

Лог = Логирование.ПолучитьЛог("oscript.app.opm");
