&Пластилин
Перем СервисКонтента;

&Контроллер("/packages")
&Отображение(Шаблон = "./app/view/_layout.html", Метод = "ПолучитьМодельМакета")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

Функция ПолучитьМодельМакета() Экспорт
	Возврат Новый Структура("Selected", 2);
КонецФункции

&ТочкаМаршрута("")
&Отображение("./app/view/packages_index.html")
Процедура Список(Ответ) Экспорт
	Ответ.Модель = СервисКонтента.ТаблицаПакетов();
КонецПроцедуры

&ТочкаМаршрута("search")
&Отображение("./app/view/packages_index.html")
Процедура Поиск(Ответ, ПараметрыЗапросаИменные) Экспорт
	Текст = ПараметрыЗапросаИменные["text"];
	Если ПустаяСтрока(Текст) Тогда
		Ответ.Перенаправить("/packages");
		Возврат;
	КонецЕсли;
	Ответ.Модель = СервисКонтента.ПоискПакетов(Текст);
КонецПроцедуры
