&Пластилин
Перем СервисКонтента;

&Контроллер("/package")
&Отображение(Шаблон = "./app/view/_homeLayout.html", Метод = "ПолучитьМодельМакета")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

Функция ПолучитьМодельМакета() Экспорт
	Возврат Новый Структура("Selected", 2);
КонецФункции

&ТочкаМаршрута("{id}")
&Отображение("./app/view/package_details.html")
Процедура Детали(Ответ, id) Экспорт

	ДанныеПакета = СервисКонтента.ДанныеПакетаПоКоду(id);

	Модель = Новый Структура;
	Модель.Вставить("id", id);
	Модель.Вставить("PackageData", ДанныеПакета);
	Модель.Вставить("DescriptionPage", СервисКонтента.ПолучитьСодержимоеReadme(ДанныеПакета.ПутьХранения));
	Модель.Вставить("Версии", СервисКонтента.ВерсииДляЗагрузки(ДанныеПакета));

	Ответ.Модель = Модель;

КонецПроцедуры
