&Пластилин
Перем КонфигурацияХаба;

&Контроллер("/dev-channel")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ТочкаМаршрута("")
Процедура ОтдатьФайл(Ответ, ПараметрыЗапросаПорядковые) Экспорт

	Если ПараметрыЗапросаПорядковые = Неопределено Или ПараметрыЗапросаПорядковые.Количество() = 0 Тогда
		Ответ.УстановитьСостояниеНеНайдено();
		Возврат;
	КонецЕсли;

	ОтносительныйПуть = "dev-channel";
	Для Каждого Сегмент Из ПараметрыЗапросаПорядковые Цикл
		ОтносительныйПуть = ОбъединитьПути(ОтносительныйПуть, Сегмент);
	КонецЦикла;

	ПутьКФайлу = ОбъединитьПути(КонфигурацияХаба.КаталогХраненияПакетов(), ОтносительныйПуть);
	ИскомыйФайл = Новый Файл(ПутьКФайлу);
	Если Не (ИскомыйФайл.Существует() И ИскомыйФайл.ЭтоФайл()) Тогда
		Ответ.УстановитьСостояниеНеНайдено();
		Возврат;
	КонецЕсли;

	Ответ.Заголовки["Content-Type"] = "application/octet-stream";
	Ответ.Заголовки["Content-Disposition"] = СтрШаблон("attachment; filename=""%1""", ИскомыйФайл.Имя);
	Ответ.ТелоДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);

КонецПроцедуры
