#Использовать logos
#Использовать fs
#Использовать github

Перем мКаталогСкачивания;
Перем Клиент;
Перем Канал;
Перем Лог;
Перем мХранилищеПакетов;

Процедура Инициализация(Знач КаталогСкачивания, Знач ХранилищеПакетов, Знач ТокенGitHub, Знач КаталогПакетов) Экспорт
	мКаталогСкачивания = КаталогСкачивания;
	мХранилищеПакетов = ХранилищеПакетов;
	ФС.ОбеспечитьКаталог(КаталогСкачивания);
	Лог = Логирование.ПолучитьЛог("oscript.web.hub.readme");
	Канал = КаталогПакетов;
	Клиент = Новый КлиентGitHub(ТокенGitHub);
КонецПроцедуры

Процедура СоздатьФайлыОписаний() Экспорт
	Организация = Клиент.ПолучитьОрганизацию("oscript-library");
	Лог.Информация("Запрашиваю список репозиториев");
	Навигатор = Новый НавигаторРепозиториев(Организация);
	Пока Навигатор.ПолучитьСледующие(Клиент) Цикл
		Лог.Информация("Получаю очередную порцию");
		СохранитьФайлОписанияДляПорции(Навигатор.Репозитории());
	КонецЦикла;
КонецПроцедуры

Процедура СохранитьФайлОписанияДляПорции(Знач СписокРепозиториев)
	Для Каждого Репозиторий Из СписокРепозиториев Цикл

		Лог.Информация("Получаю README для " + Репозиторий.Имя);
		Контент = Клиент.ПолучитьКонтент(Репозиторий, "readme");
		Если Контент = Неопределено Тогда
			Лог.Ошибка("Не удалось получить описание для " + Репозиторий.Имя);
			Продолжить;
		КонецЕсли;

		ИмяПакета = Репозиторий.Имя;
		Пакет = мХранилищеПакетов.НайтиПоКоду(ИмяПакета);
		Если Пакет = Неопределено Тогда
			Пакет = мХранилищеПакетов.НайтиПоИмениПроекта(ИмяПакета);
		КонецЕсли;
		Если Пакет = Неопределено Тогда
			Лог.Информация("Пропускаю репо %1, нет в БД", Репозиторий.Имя);
			Продолжить;
		КонецЕсли;

		КаталогРепозитория = ОбъединитьПути(мКаталогСкачивания, Пакет.Код);
		Если Не ФС.КаталогСуществует(КаталогРепозитория) Тогда
			Лог.Информация("Пропускаю репо %1, целевой каталог отсутствует", Репозиторий.Имя);
			Продолжить;
		КонецЕсли;

		ДД = Контент.ДвоичныеДанные();
		Если ДД = Неопределено Тогда
			Лог.Ошибка("Двоичные данные readme не получены");
			Продолжить;
		КонецЕсли;

		ДД.Записать(ОбъединитьПути(КаталогРепозитория, Контент.Имя));

		ЕстьИзменения = Ложь;
		Если Не ЗначениеЗаполнено(Пакет.ПутьКОписанию) Тогда
			Пакет.ПутьКОписанию = ОбъединитьПути(Канал, ИмяПакета, Контент.Имя);
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Пакет.СсылкаНаПроект) Тогда
			Пакет.СсылкаНаПроект = Репозиторий.СсылкаHTML;
			ЕстьИзменения = Истина;
		КонецЕсли;

		Если ЕстьИзменения Тогда
			мХранилищеПакетов.Сохранить(Пакет);
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры
