#Использовать messenger
#Использовать logos

&Пластилин
Перем КонфигурацияХаба;

Перем Лог;

&Желудь
&Прозвище("СервисУведомлений")
Процедура ПриСозданииОбъекта()
	Лог = Логирование.ПолучитьЛог("oscript.web.hub.notifications");
КонецПроцедуры

Процедура УведомитьОРелизе(Знач ИмяПакета, Знач АдресПроекта, Знач Версия, Знач ПользовательGitHub) Экспорт

	Если Не КонфигурацияХаба.ОтправлятьУведомлениеВТелеграмм Тогда
		Возврат;
	КонецЕсли;

	Шаблон = "🔥 %1 опубликовал версию пакета %2 %3
	|Проект: [%4](%5)
	|Автор публикации: [%6](https://github.com/%6)";

	ПредставлениеПроекта = СтрЗаменить(АдресПроекта, "https://github.com/", "");
	Сообщение = СтрШаблон(
		Шаблон,
		ПользовательGitHub.Имя,
		ИмяПакета,
		Версия,
		ПредставлениеПроекта,
		АдресПроекта,
		ПользовательGitHub.Логин
	);

	Попытка
		Мессенджер = Новый Мессенджер();
		Мессенджер.ИнициализироватьТранспорт("telegram", Новый Структура("Логин", КонфигурацияХаба.ТокенАвторизацииТелеграмм));
		Мессенджер.ОтправитьСообщение("telegram", КонфигурацияХаба.ИдентификаторГруппыУведомленияВТелеграмм, Сообщение, , "md");
	Исключение
		Лог.Ошибка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры
