#Использовать strings

Перем МаксимальноеInt32;

&Желудь
&Прозвище("СортировкаВерсий")
Процедура ПриСозданииОбъекта()
	МаксимальноеInt32 = 2147483647;
КонецПроцедуры

Процедура СортироватьВерсии(ВходящиеДанные, Знач ПорядокСортировки = "ВОЗР") Экспорт

	Массив = ВходящиеДанные;
	Количество = Массив.Количество();
	Если Количество > 0 Тогда
		БыстраяСортировка(Массив, 0, Количество - 1, ПорядокСортировки);
	КонецЕсли;
	ВходящиеДанные = Массив;

КонецПроцедуры

Процедура БыстраяСортировка(МассивДанных, ЛевоеЗначение, ПравоеЗначение, Знач ПорядокСортировки = "ВОЗР")

	ПорядокСортировки = ВРег(ПорядокСортировки);

	ЛевоеЗначениеФиксированное = ЛевоеЗначение;
	ПравоеЗначениеФиксированное = ПравоеЗначение;
	ОпорноеЗначение = МассивДанных[ЛевоеЗначение];

	Пока ЛевоеЗначение < ПравоеЗначение Цикл

		Пока ?(ПорядокСортировки = "ВОЗР",
				ВерсияБольшеИлиРавна(МассивДанных[ПравоеЗначение], ОпорноеЗначение),
				ВерсияМеньшеИлиРавна(МассивДанных[ПравоеЗначение], ОпорноеЗначение))
				И ЛевоеЗначение < ПравоеЗначение Цикл
			ПравоеЗначение = ПравоеЗначение - 1;
		КонецЦикла;

		Если ЛевоеЗначение <> ПравоеЗначение Тогда
			МассивДанных[ЛевоеЗначение] = МассивДанных[ПравоеЗначение];
			ЛевоеЗначение = ЛевоеЗначение + 1;
		КонецЕсли;

		Пока ?(ПорядокСортировки = "ВОЗР",
				ВерсияМеньшеИлиРавна(МассивДанных[ЛевоеЗначение], ОпорноеЗначение),
				ВерсияБольшеИлиРавна(МассивДанных[ЛевоеЗначение], ОпорноеЗначение))
				И ЛевоеЗначение < ПравоеЗначение Цикл
			ЛевоеЗначение = ЛевоеЗначение + 1;
		КонецЦикла;

		Если ЛевоеЗначение <> ПравоеЗначение Тогда
			МассивДанных[ПравоеЗначение] = МассивДанных[ЛевоеЗначение];
			ПравоеЗначение = ПравоеЗначение - 1;
		КонецЕсли;

	КонецЦикла;

	МассивДанных[ЛевоеЗначение] = ОпорноеЗначение;
	ОпорноеЗначение = ЛевоеЗначение;
	ЛевоеЗначение = ЛевоеЗначениеФиксированное;
	ПравоеЗначение = ПравоеЗначениеФиксированное;

	Если ЛевоеЗначение < ОпорноеЗначение Тогда
		БыстраяСортировка(МассивДанных, ЛевоеЗначение, ОпорноеЗначение - 1, ПорядокСортировки);
	КонецЕсли;
	Если ПравоеЗначение > ОпорноеЗначение Тогда
		БыстраяСортировка(МассивДанных, ОпорноеЗначение + 1, ПравоеЗначение, ПорядокСортировки);
	КонецЕсли;

КонецПроцедуры

Функция ВерсияБольшеИлиРавна(Версия1, Версия2)
	Возврат СравнитьВерсии(Версия1, Версия2) >= 0;
КонецФункции

Функция ВерсияМеньшеИлиРавна(Версия1, Версия2)
	Возврат СравнитьВерсии(Версия1, Версия2) <= 0;
КонецФункции

Функция СравнитьВерсии(Знач ВерсияА, Знач ВерсияБ)

	МассивА = СтрРазделить(ПреобразоватьВерсиюВЦифры(Строка(ВерсияА)), ".");
	МассивБ = СтрРазделить(ПреобразоватьВерсиюВЦифры(Строка(ВерсияБ)), ".");

	КоличествоА = МассивА.Количество();
	КоличествоБ = МассивБ.Количество();
	МаксЭлементов = Макс(КоличествоА, КоличествоБ);

	Для Индекс = 0 По МаксЭлементов - 1 Цикл
		Если КоличествоА - 1 < Индекс Тогда
			ПривестиЗначениеМассива(МассивА, МассивБ, Индекс);
		КонецЕсли;
		Если КоличествоБ - 1 < Индекс Тогда
			ПривестиЗначениеМассива(МассивБ, МассивА, Индекс);
		КонецЕсли;

		МассивА[Индекс] = СтроковыеФункции.СтрокаВЧисло(МассивА[Индекс]);
		МассивБ[Индекс] = СтроковыеФункции.СтрокаВЧисло(МассивБ[Индекс]);

		Если МассивА[Индекс] > МассивБ[Индекс] Тогда
			Возврат 1;
		КонецЕсли;
		Если МассивА[Индекс] < МассивБ[Индекс] Тогда
			Возврат -1;
		КонецЕсли;
	КонецЦикла;

	Возврат 0;

КонецФункции

Процедура ПривестиЗначениеМассива(МассивА, МассивБ, Индекс)
	Если СтроковыеФункции.СтрокаВЧисло(МассивБ[Индекс]) < 0 Тогда
		МассивА.Добавить("-" + МаксимальноеInt32);
	Иначе
		МассивА.Добавить("0");
	КонецЕсли;
КонецПроцедуры

Функция ПреобразоватьВерсиюВЦифры(Знач Значение)
	Новое = "";
	Для НомерСимвола = 1 По СтрДлина(Значение) Цикл
		Символ = Сред(Значение, НомерСимвола, 1);
		Если Символ = "." Или СтроковыеФункции.ТолькоЦифрыВСтроке(Символ) Тогда
			Новое = Новое + Символ;
		Иначе
			Новое = Новое + СтрШаблон(".%1.", КодСимвола(Лев(НРег(Символ), 1)) - МаксимальноеInt32);
		КонецЕсли;
	КонецЦикла;
	Возврат Новое;
КонецФункции
