#Использовать entity

&Родитель
Перем ХранилищеСущностей;

&ХранилищеСущностей("ВерсияПакета")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

Функция НайтиВерсиюПакета(Знач КодПакета, Знач НомерВерсии) Экспорт
	ОпцииПоиска = Новый ОпцииПоиска();
	ОпцииПоиска.Отбор("Пакет", ВидСравнения.Равно, КодПакета);
	ОпцииПоиска.Отбор("Номер", ВидСравнения.Равно, НомерВерсии);
	Результат = ХранилищеСущностей.Получить(ОпцииПоиска);
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0];
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция Версии(Знач КодПакета) Экспорт
	ОпцииПоиска = Новый ОпцииПоиска();
	ОпцииПоиска.Отбор("Пакет", ВидСравнения.Равно, КодПакета);
	Возврат ХранилищеСущностей.Получить(ОпцииПоиска);
КонецФункции

Процедура Сохранить(Знач Версия) Экспорт
	ХранилищеСущностей.Сохранить(Версия);
КонецПроцедуры

Процедура Удалить(Знач Версия) Экспорт
	ХранилищеСущностей.Удалить(Версия);
КонецПроцедуры

Функция Создать() Экспорт
	Возврат Новый ВерсияПакета;
КонецФункции
