#Использовать entity

&Родитель
Перем ХранилищеСущностей;

&ХранилищеСущностей("Автор")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

Функция НайтиПоИмени(Знач Имя) Экспорт
	ОпцииПоиска = Новый ОпцииПоиска();
	ОпцииПоиска.Отбор("Имя", ВидСравнения.Равно, Имя);
	Результат = ХранилищеСущностей.Получить(ОпцииПоиска);
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0];
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция НайтиИлиСоздать(Знач ИмяАвтора) Экспорт
	Если Не ЗначениеЗаполнено(ИмяАвтора) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Автор = НайтиПоИмени(ИмяАвтора);
	Если Автор = Неопределено Тогда
		Автор = Новый Автор;
	КонецЕсли;
	Автор.Имя = ИмяАвтора;
	ХранилищеСущностей.Сохранить(Автор);
	Возврат Автор;
КонецФункции

Функция Все() Экспорт
	Возврат ХранилищеСущностей.Получить();
КонецФункции

Процедура Удалить(Знач Автор) Экспорт
	ХранилищеСущностей.Удалить(Автор);
КонецПроцедуры
